

**import required packages**

In [14]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

**Read the data**

In [17]:
file_path="C:\\Users\\lenovo\\Desktop\\Data Science course\\Data Files\\Visadataset.csv"
visa_df=pd.read_csv(file_path)#visa_dataset
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

**Create data Frame by using list**

In [22]:
list1=['Hyderabad','Bangalore','Chennai']
list2=['022','080','040']
cols=['City','Code']
city=pd.DataFrame(zip(list1,list2),columns=cols)
# I created a dataframe and I saved in a varaiable city
city

        City Code
0  Hyderabad  022
1  Bangalore  080
2    Chennai  040

In [25]:
import os
os.getcwd()

'C:\\Users\\lenovo'

In [26]:
#Save the data in local
city.to_csv('city1.csv')
#extra index column created

In [27]:
city.to_csv('city2.csv',index=False)#no extra index column

- I create a dataframe using list, data frame name: **city**

- I saved the dataframe in local with index: **city1.csv**
    
- I saved the dataframe in local with out index: **city2.csv**

**Read those dataframes**

In [30]:
# both python file and data file are at same location
# no need to provide full path location
pd.read_csv('city1.csv')

   Unnamed: 0       City  Code
0           0  Hyderabad    22
1           1  Bangalore    80
2           2    Chennai    40

In [31]:
pd.read_csv('city2.csv')

        City  Code
0  Hyderabad    22
1  Bangalore    80
2    Chennai    40

**Chane the index**

In [32]:
#change the index
list1=['Hyderabad','Bangalore','Chennai']
list2=['022','080','040']
cols=['City','Code']

cols=['City','Code']
city=pd.DataFrame(zip(list1,list2),
                  columns=cols,
                  index=['A','B','C'])
city

        City Code
A  Hyderabad  022
B  Bangalore  080
C    Chennai  040

**How to add new column**

In [33]:
# what is your dataframe name:city
# what is the new column want to add: Product
# How many rows in your data: 3
# what are the new values for product:['Car','Bus','Train']
city['product']=['Car','Bus','Train']

In [34]:
city

        City Code product
A  Hyderabad  022     Car
B  Bangalore  080     Bus
C    Chennai  040   Train

**How to drop a column**

In [36]:
# what is the name of dataframe: City
# Which column you need to drop: Product
# axis =1 ============ > columns
# axis=0 ============== > rows
# You are modifying the table , do you want save the results in same 'city' variable
# or you want to create a new variable

# Suppose I want to keep in same 'City varaible':  inplace=True
city.drop('product',
          axis=1,
          inplace=True)

In [37]:
city

        City Code
A  Hyderabad  022
B  Bangalore  080
C    Chennai  040

 **Create a Dataframe using Dictionary**

In [40]:
dict1={'Name':['Tharun','Ram','Gowtham'],'Age':[24,30,25]}
dict1

{'Name': ['Tharun', 'Ram', 'Gowtham'], 'Age': [24, 30, 25]}

In [41]:
# keys automatically consider as columns
# values automatically consider as rows
pd.DataFrame(dict1)

      Name  Age
0   Tharun   24
1      Ram   30
2  Gowtham   25

**If the values are not in list, then pass the index**

In [43]:
dict2={'Name':'Tharun','city':'hyderabad','Age':25}
dict2

{'Name': 'Tharun', 'city': 'hyderabad', 'Age': 25}

In [44]:
pd.DataFrame(dict2)#it shows error u mas pass the index

ValueError: If using all scalar values, you must pass an index

In [49]:
pd.DataFrame(dict2,index=[0,1,2])

     Name       city  Age
0  Tharun  hyderabad   25
1  Tharun  hyderabad   25
2  Tharun  hyderabad   25